## Load Data

In [1]:
import sqlite3
from sqlite3 import Error

 
def create_connection(db_file):
    """ create a database connection to the SQLite database
        specified by the db_file
    :param db_file: database file
    :return: Connection object or None
    """
    conn = None
    try:
        conn = sqlite3.connect(db_file)
        print(sqlite3.version)
    except Error as e:
        print(e)
 
    return conn

 
def select_all_tasks(conn):
    """
    Query all rows in the tasks table
    :param conn: the Connection object
    :return:
    """
    cur = conn.cursor()
    
    query1 = """
        SELECT *
        FROM FACILITIES
        """
    cur.execute(query1)
 
    rows = cur.fetchall()
 
    for row in rows:
        print(row)


def main():
    database = "sqlite_db_pythonsqlite.db"
 
    # create a database connection
    conn = create_connection(database)
    with conn: 
        print("2. Query all tasks")
        select_all_tasks(conn)
 
 
if __name__ == '__main__':
    main()

2.6.0
2. Query all tasks
(0, 'Tennis Court 1', 5, 25, 10000, 200)
(1, 'Tennis Court 2', 5, 25, 8000, 200)
(2, 'Badminton Court', 0, 15.5, 4000, 50)
(3, 'Table Tennis', 0, 5, 320, 10)
(4, 'Massage Room 1', 9.9, 80, 4000, 3000)
(5, 'Massage Room 2', 9.9, 80, 4000, 3000)
(6, 'Squash Court', 3.5, 17.5, 5000, 80)
(7, 'Snooker Table', 0, 5, 450, 15)
(8, 'Pool Table', 0, 5, 400, 15)

The example above is a traditional way to connect to a database through code. Below, is a different way used for notebooks.

In [75]:
# !pip install ipython-sql

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///sqlite_db_pythonsqlite.db

## Examine Data

In [12]:
%%sql
SELECT *
FROM Bookings
LIMIT 10;

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[(0, 3, 1, '2012-07-03 11:00:00', 2),
 (1, 4, 1, '2012-07-03 08:00:00', 2),
 (2, 6, 0, '2012-07-03 18:00:00', 2),
 (3, 7, 1, '2012-07-03 19:00:00', 2),
 (4, 8, 1, '2012-07-03 10:00:00', 1),
 (5, 8, 1, '2012-07-03 15:00:00', 1),
 (6, 0, 2, '2012-07-04 09:00:00', 3),
 (7, 0, 2, '2012-07-04 15:00:00', 3),
 (8, 4, 3, '2012-07-04 13:30:00', 2),
 (9, 4, 0, '2012-07-04 15:00:00', 2)]

In [14]:
%%sql
SELECT *
FROM Facilities
LIMIT 10;

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[(0, 'Tennis Court 1', 5, 25, 10000, 200),
 (1, 'Tennis Court 2', 5, 25, 8000, 200),
 (2, 'Badminton Court', 0, 15.5, 4000, 50),
 (3, 'Table Tennis', 0, 5, 320, 10),
 (4, 'Massage Room 1', 9.9, 80, 4000, 3000),
 (5, 'Massage Room 2', 9.9, 80, 4000, 3000),
 (6, 'Squash Court', 3.5, 17.5, 5000, 80),
 (7, 'Snooker Table', 0, 5, 450, 15),
 (8, 'Pool Table', 0, 5, 400, 15)]

In [17]:
%%sql
SELECT *
FROM Members
LIMIT 10;

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[(0, 'GUEST', 'GUEST', 'GUEST', 0, '(000) 000-0000', '', '2012-07-01 00:00:00'),
 (1, 'Smith', 'Darren', '8 Bloomsbury Close, Boston', 4321, '555-555-5555', '', '2012-07-02 12:02:05'),
 (2, 'Smith', 'Tracy', '8 Bloomsbury Close, New York', 4321, '555-555-5555', '', '2012-07-02 12:08:23'),
 (3, 'Rownam', 'Tim', '23 Highway Way, Boston', 23423, '(844) 693-0723', '', '2012-07-03 09:32:15'),
 (4, 'Joplette', 'Janice', '20 Crossing Road, New York', 234, '(833) 942-4710', '1', '2012-07-03 10:25:05'),
 (5, 'Butters', 'Gerald', '1065 Huntingdon Avenue, Boston', 56754, '(844) 078-4130', '1', '2012-07-09 10:44:09'),
 (6, 'Tracy', 'Burton', '3 Tunisia Drive, Boston', 45678, '(822) 354-9973', '', '2012-07-15 08:52:55'),
 (7, 'Dare', 'Nancy', '6 Hunting Lodge Way, Boston', 10383, '(833) 776-4001', '4', '2012-07-25 08:59:12'),
 (8, 'Boothe', 'Tim', '3 Bloomsbury Close, Reading, 00234', 234, '(811) 433-2547', '3', '2012-07-25 16:02:35'),
 (9, 'Stibbons', 'Ponder', '5 Dragons Way, Winchester', 87630, '(833) 160-3900', '6', '2012-07-25 17:09:05')]

## QUESTIONS

Q1: Some of the facilities charge a fee to members, but some do not.
Write a SQL query to produce a list of the names of the facilities that do.

In [79]:
%%sql
SELECT name
FROM Facilities
WHERE MemberCost > 0

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Tennis Court 1',),
 ('Tennis Court 2',),
 ('Massage Room 1',),
 ('Massage Room 2',),
 ('Squash Court',)]

Q2: How many facilities do not charge a fee to members?

In [81]:
%%sql
SELECT Count(*) as no_fee
FROM Facilities
WHERE MemberCost = 0

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[(4,)]

Q3: Write an SQL query to show a list of facilities that charge a fee to members,
where the fee is less than 20% of the facility's monthly maintenance cost.
Return the facid, facility name, member cost, and monthly maintenance of the
facilities in question.

All of them (9).

In [82]:
%%sql
SELECT facid, name, membercost, monthlymaintenance
FROM Facilities
WHERE membercost < (monthlymaintenance * 0.2)

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[(0, 'Tennis Court 1', 5, 200),
 (1, 'Tennis Court 2', 5, 200),
 (2, 'Badminton Court', 0, 50),
 (3, 'Table Tennis', 0, 10),
 (4, 'Massage Room 1', 9.9, 3000),
 (5, 'Massage Room 2', 9.9, 3000),
 (6, 'Squash Court', 3.5, 80),
 (7, 'Snooker Table', 0, 15),
 (8, 'Pool Table', 0, 15)]

Q4: Write an SQL query to retrieve the details of facilities with ID 1 and 5.
Try writing the query without using the OR operator.

In [83]:
%%sql
SELECT *
FROM Facilities
WHERE facid in (1,5)

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[(1, 'Tennis Court 2', 5, 25, 8000, 200),
 (5, 'Massage Room 2', 9.9, 80, 4000, 3000)]

Q5: Produce a list of facilities, with each labelled as
'cheap' or 'expensive', depending on if their monthly maintenance cost is
more than $100. Return the name and monthly maintenance of the facilities
in question.

Think this could have a couple different solutions. Assuming the below based off of later questions.

In [84]:
%%sql
SELECT name, monthlymaintenance, ( CASE
		WHEN monthlymaintenance > 100 THEN 'expensive'
		ELSE 'cheap'
     END ) AS label
FROM Facilities
ORDER BY monthlymaintenance desc

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Massage Room 1', 3000, 'expensive'),
 ('Massage Room 2', 3000, 'expensive'),
 ('Tennis Court 1', 200, 'expensive'),
 ('Tennis Court 2', 200, 'expensive'),
 ('Squash Court', 80, 'cheap'),
 ('Badminton Court', 50, 'cheap'),
 ('Snooker Table', 15, 'cheap'),
 ('Pool Table', 15, 'cheap'),
 ('Table Tennis', 10, 'cheap')]

However, it could also be changing just the column 'name' using as.

In [87]:
%%sql
SELECT name AS expensive, monthlymaintenance
FROM Facilities AS f
WHERE monthlymaintenance > 100
ORDER BY monthlymaintenance desc

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Massage Room 1', 3000),
 ('Massage Room 2', 3000),
 ('Tennis Court 1', 200),
 ('Tennis Court 2', 200)]

In [88]:
%%sql
SELECT name as cheap, monthlymaintenance
FROM Facilities
WHERE monthlymaintenance < 100
ORDER BY monthlymaintenance

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Table Tennis', 10),
 ('Snooker Table', 15),
 ('Pool Table', 15),
 ('Badminton Court', 50),
 ('Squash Court', 80)]

Q6: You'd like to get the first and last name of the last member(s)
who signed up. Try not to use the LIMIT clause for your solution.

In [90]:
%%sql
SELECT firstname, surname
FROM Members
WHERE joindate = (
    SELECT MAX(joindate)
    FROM Members
    )

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Darren', 'Smith')]

Darren Smith (there are multiple) on 2012-09-26 18:08:45.

Simpler to do with limit.

In [91]:
%%sql
SELECT firstname, surname
FROM Members
ORDER BY joindate desc
LIMIT 1

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Darren', 'Smith')]

Q7: Produce a list of all members who have used a tennis court.
Include in your output the name of the court, and the name of the member
formatted as a single column. Ensure no duplicate data, and order by
the member name.

46 records. Some of the names are duplicated because they played on both tennis courts.

In [93]:
%%sql
SELECT DISTINCT m.firstname || ' ' || m.surname AS fullname, f.name
FROM Members AS m
JOIN Bookings AS b ON b.memid = m.memid
JOIN Facilities AS f ON b.facid = f.facid
WHERE f.facid
IN (
    SELECT facid
	FROM Facilities
	WHERE name LIKE '%tennis court%'
)
ORDER BY fullname

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Anne Baker', 'Tennis Court 1'),
 ('Anne Baker', 'Tennis Court 2'),
 ('Burton Tracy', 'Tennis Court 2'),
 ('Burton Tracy', 'Tennis Court 1'),
 ('Charles Owen', 'Tennis Court 1'),
 ('Charles Owen', 'Tennis Court 2'),
 ('Darren Smith', 'Tennis Court 2'),
 ('David Farrell', 'Tennis Court 1'),
 ('David Farrell', 'Tennis Court 2'),
 ('David Jones', 'Tennis Court 2'),
 ('David Jones', 'Tennis Court 1'),
 ('David Pinker', 'Tennis Court 1'),
 ('Douglas Jones', 'Tennis Court 1'),
 ('Erica Crumpet', 'Tennis Court 1'),
 ('Florence Bader', 'Tennis Court 2'),
 ('Florence Bader', 'Tennis Court 1'),
 ('GUEST GUEST', 'Tennis Court 2'),
 ('GUEST GUEST', 'Tennis Court 1'),
 ('Gerald Butters', 'Tennis Court 1'),
 ('Gerald Butters', 'Tennis Court 2'),
 ('Henrietta Rumney', 'Tennis Court 2'),
 ('Jack Smith', 'Tennis Court 1'),
 ('Jack Smith', 'Tennis Court 2'),
 ('Janice Joplette', 'Tennis Court 1'),
 ('Janice Joplette', 'Tennis Court 2'),
 ('Jemima Farrell', 'Tennis Court 2'),
 ('Jemima Farrell', 'Tennis Court 1'),
 ('Joan Coplin', 'Tennis Court 1'),
 ('John Hunt', 'Tennis Court 1'),
 ('John Hunt', 'Tennis Court 2'),
 ('Matthew Genting', 'Tennis Court 1'),
 ('Millicent Purview', 'Tennis Court 2'),
 ('Nancy Dare', 'Tennis Court 2'),
 ('Nancy Dare', 'Tennis Court 1'),
 ('Ponder Stibbons', 'Tennis Court 2'),
 ('Ponder Stibbons', 'Tennis Court 1'),
 ('Ramnaresh Sarwin', 'Tennis Court 2'),
 ('Ramnaresh Sarwin', 'Tennis Court 1'),
 ('Tim Boothe', 'Tennis Court 2'),
 ('Tim Boothe', 'Tennis Court 1'),
 ('Tim Rownam', 'Tennis Court 2'),
 ('Tim Rownam', 'Tennis Court 1'),
 ('Timothy Baker', 'Tennis Court 2'),
 ('Timothy Baker', 'Tennis Court 1'),
 ('Tracy Smith', 'Tennis Court 1'),
 ('Tracy Smith', 'Tennis Court 2')]

/* Q8: Produce a list of bookings on the day of 2012-09-14 which
will cost the member (or guest) more than $30. Remember that guests have
different costs to members (the listed costs are per half-hour 'slot'), and
the guest user's ID is always 0. Include in your output the name of the
facility, the name of the member formatted as a single column, and the cost.
Order by descending cost, and do not use any subqueries. */

In [96]:
%%sql
SELECT DISTINCT 
	f.name, 
	m.firstname || ' ' || m.surname AS fullname, 
	( CASE
		WHEN m.memid = 0 THEN (f.guestcost * b.slots)
		ELSE (f.membercost * b.slots)
     END ) AS cost
FROM Members AS m
JOIN Bookings AS b ON b.memid = m.memid
JOIN Facilities AS f ON b.facid = f.facid
WHERE 
    b.starttime BETWEEN '2012-09-14 00:00:00' AND '2012-09-14 23:59:59'
		AND 
		    m.memid = 0 AND (f.guestcost * b.slots) > 30
		OR
		    m.memid != 0 AND (f.membercost * b.slots) > 30
ORDER BY cost DESC

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Massage Room 2', 'GUEST GUEST', 320),
 ('Massage Room 1', 'GUEST GUEST', 160),
 ('Tennis Court 2', 'GUEST GUEST', 150),
 ('Tennis Court 1', 'GUEST GUEST', 75),
 ('Tennis Court 2', 'GUEST GUEST', 75),
 ('Squash Court', 'GUEST GUEST', 70.0),
 ('Tennis Court 1', 'Nancy Dare', 45),
 ('Tennis Court 2', 'Tim Boothe', 45),
 ('Massage Room 1', 'Tim Rownam', 39.6),
 ('Massage Room 1', 'Gerald Butters', 39.6),
 ('Massage Room 1', 'Darren Smith', 39.6),
 ('Massage Room 1', 'Tim Boothe', 39.6),
 ('Massage Room 1', 'Ponder Stibbons', 39.6),
 ('Massage Room 1', 'Jemima Farrell', 39.6),
 ('Massage Room 1', 'David Jones', 39.6),
 ('Massage Room 1', 'Timothy Baker', 39.6),
 ('Massage Room 1', 'Matthew Genting', 39.6),
 ('Squash Court', 'GUEST GUEST', 35.0)]

Q9: This time, produce the same result as in Q8, but using a subquery.

While I was building this sql.springboard became unavailable.  
Think it will be similar to the below and the performance will be very slow.

In [ ]:
%%sql
/*
SELECT DISTINCT
	f.name,
	m.firstname || ' ' || m.surname AS fullname,
	( CASE
		WHEN m.memid = 0 THEN (f.guestcost * b.slots)
		ELSE (f.membercost * b.slots)
     END ) AS cost
FROM Facilities AS f, Bookings AS b, Members AS m
WHERE f.facid IN (
    SELECT b.facid 
    FROM Bookings as b
    WHERE 
		b.starttime BETWEEN '2012-09-14 00:00:00' AND '2012-09-14 23:59:59'
		AND 
			m.memid = 0 AND (f.guestcost * b.slots) > 30
			OR
			m.memid != 0 AND (f.membercost * b.slots) > 30
	AND
		b.facid IN (
            SELECT m.memid
            FROM Members AS m
            WHERE b.memid = m.memid AND b.facid = f.facid
        )
)
ORDER BY cost DESC
*/

 * sqlite:///sqlite_db_pythonsqlite.db

Q10: Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members!

In [30]:
%%sql
SELECT 
    f.name,
    ( CASE
		WHEN m.memid = 0 THEN SUM((f.guestcost * b.slots))
		ELSE SUM((f.membercost * b.slots))
     END ) AS revenue
FROM Members as m
JOIN Bookings AS b ON b.memid = m.memid
JOIN Facilities AS f ON b.facid = f.facid
GROUP BY f.name
HAVING revenue < 1000
ORDER BY revenue;

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Badminton Court', 0),
 ('Pool Table', 0),
 ('Snooker Table', 0),
 ('Table Tennis', 0)]

Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order.

TODO: Add the recommendedby full name.

In [20]:
%%sql
SELECT 
    surname || ', ' || firstname  AS fullname,
    recommendedby
FROM Members
ORDER BY fullname;

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Bader, Florence', '9'),
 ('Baker, Anne', '9'),
 ('Baker, Timothy', '13'),
 ('Boothe, Tim', '3'),
 ('Butters, Gerald', '1'),
 ('Coplin, Joan', '16'),
 ('Crumpet, Erica', '2'),
 ('Dare, Nancy', '4'),
 ('Farrell, David', ''),
 ('Farrell, Jemima', ''),
 ('GUEST, GUEST', ''),
 ('Genting, Matthew', '5'),
 ('Hunt, John', '30'),
 ('Jones, David', '4'),
 ('Jones, Douglas', '11'),
 ('Joplette, Janice', '1'),
 ('Mackenzie, Anna', '1'),
 ('Owen, Charles', '1'),
 ('Pinker, David', '13'),
 ('Purview, Millicent', '2'),
 ('Rownam, Tim', ''),
 ('Rumney, Henrietta', '20'),
 ('Sarwin, Ramnaresh', '15'),
 ('Smith, Darren', ''),
 ('Smith, Darren', ''),
 ('Smith, Jack', '1'),
 ('Smith, Tracy', ''),
 ('Stibbons, Ponder', '6'),
 ('Tracy, Burton', ''),
 ('Tupperware, Hyacinth', ''),
 ('Worthington-Smyth, Henry', '2')]

In [23]:
%%sql
SELECT 
    surname || ', ' || firstname  AS fullname,
    recommendedby
FROM Members
WHERE recommendedby > 0
ORDER BY fullname;

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Bader, Florence', '9'),
 ('Baker, Anne', '9'),
 ('Baker, Timothy', '13'),
 ('Boothe, Tim', '3'),
 ('Butters, Gerald', '1'),
 ('Coplin, Joan', '16'),
 ('Crumpet, Erica', '2'),
 ('Dare, Nancy', '4'),
 ('Genting, Matthew', '5'),
 ('Hunt, John', '30'),
 ('Jones, David', '4'),
 ('Jones, Douglas', '11'),
 ('Joplette, Janice', '1'),
 ('Mackenzie, Anna', '1'),
 ('Owen, Charles', '1'),
 ('Pinker, David', '13'),
 ('Purview, Millicent', '2'),
 ('Rumney, Henrietta', '20'),
 ('Sarwin, Ramnaresh', '15'),
 ('Smith, Jack', '1'),
 ('Stibbons, Ponder', '6'),
 ('Worthington-Smyth, Henry', '2')]

Q12: Find the facilities with their usage by member, but not guests

In [46]:
%%sql
SELECT 
    f.name,
    ( CASE
		WHEN m.memid = 0 THEN 0
		ELSE SUM(b.slots)
     END ) AS use
FROM Members as m
JOIN Bookings AS b ON b.memid = m.memid
JOIN Facilities AS f ON b.facid = f.facid
GROUP BY f.name
ORDER BY use;

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Massage Room 2', 0),
 ('Squash Court', 0),
 ('Tennis Court 2', 0),
 ('Table Tennis', 830),
 ('Snooker Table', 908),
 ('Pool Table', 910),
 ('Badminton Court', 1209),
 ('Tennis Court 1', 1320),
 ('Massage Room 1', 1404)]

The results above looked off to me. 
Therefore, did different query to see what the bookings were just for guests, just for non-guests, and everyone.
The results below show that the facilities with zeros above are exlusively used by guests.

In [57]:
%%sql

SELECT 
    f.name,
    SUM(b.slots) AS use
FROM Bookings as b
JOIN Facilities AS f ON b.facid = f.facid
GROUP BY f.name
HAVING b.memid = 0
ORDER BY use;

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Massage Room 2', 228), ('Squash Court', 1104), ('Tennis Court 2', 1278)]

Q13: Find the facilities usage by month, but not guests.

In [74]:
%%sql
SELECT 
    f.name,
    SUM(b.slots) AS use,
    strftime("%Y-%m", b.starttime) AS 'year-month'
FROM Bookings as b
JOIN Facilities AS f ON b.facid = f.facid
GROUP BY f.name, strftime("%Y-%m", b.starttime)
HAVING b.memid != 0
ORDER BY use desc

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Massage Room 1', 648, '2012-09'),
 ('Badminton Court', 570, '2012-09'),
 ('Massage Room 1', 492, '2012-08'),
 ('Tennis Court 2', 483, '2012-08'),
 ('Pool Table', 471, '2012-09'),
 ('Badminton Court', 459, '2012-08'),
 ('Tennis Court 1', 459, '2012-08'),
 ('Snooker Table', 426, '2012-09'),
 ('Table Tennis', 422, '2012-09'),
 ('Snooker Table', 326, '2012-08'),
 ('Pool Table', 322, '2012-08'),
 ('Table Tennis', 304, '2012-08'),
 ('Tennis Court 1', 270, '2012-07'),
 ('Massage Room 1', 264, '2012-07'),
 ('Badminton Court', 180, '2012-07'),
 ('Snooker Table', 156, '2012-07'),
 ('Pool Table', 117, '2012-07'),
 ('Table Tennis', 104, '2012-07'),
 ('Massage Room 2', 82, '2012-08')]

In [73]:
%%sql
#The date ranges above all fall within the data's time period.

SELECT 
    MIN(starttime) AS first_booking, 
    MAX(starttime) AS last_booking
FROM Bookings

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('2012-07-03 08:00:00', '2012-09-30 19:30:00')]